Config/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Субконто</v8:Type>
						<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/РазделыМакетовОтображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыМакетовОтображения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.МакетыОтображенияОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиРаздела</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КолонкиРаздела</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КолонкаОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШапкаРаздела</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
								<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зафиксирована</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаЭлемента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезЗаголовка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПустого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НуженОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ГруппыРаскрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыРаскрытия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьСовпаденияИзмерений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/СтрокиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтрокиОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/КолонкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КолонкиОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/МакетыОтображения/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С МАКЕТАМИ ОТОБРАЖЕНИЯ
//

// Создает макет отображения отчета в виде таблицы управляемой формы
//
Функция СоздатьМакетОтображения(Знач ВидОтчета) Экспорт

	МакетСсылка = Справочники.МакетыОтображенияОтчетов.ПолучитьИспользуемыйПоУмолчанию(ВидОтчета);
	Если МакетСсылка = Неопределено Тогда 
		Макет = СоздатьМакетОтображенияПоСтруктуреОтчета(ВидОтчета);
	Иначе
		Макет = СоздатьМакетОтображенияПоОписанию(ВидОтчета, МакетСсылка);
	КонецЕсли;
	
	Возврат Макет;
	
КонецФункции 

Функция СоздатьМакетОтображенияПоОписанию(Знач ВидОтчета, Знач МакетСсылка)

	МакетОтображения = СоздатьПустойМакетОтображения();
	МакетПоСтруктуре = СоздатьМакетОтображенияПоСтруктуреОтчета(ВидОтчета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазделыМакетовОтображения.Ссылка КАК Раздел,
	|	РазделыМакетовОтображения.Наименование,
	|	РазделыМакетовОтображения.РеквизитДопУпорядочивания КАК НомерРаздела
	|ПОМЕСТИТЬ РазделыМакета
	|ИЗ
	|	Справочник.РазделыМакетовОтображения КАК РазделыМакетовОтображения
	|ГДЕ
	|	РазделыМакетовОтображения.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазделыМакета.Раздел,
	|	РазделыМакета.Наименование,
	|	РазделыМакета.НомерРаздела КАК НомерРаздела
	|ИЗ
	|	РазделыМакета КАК РазделыМакета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерРаздела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСтрокиРаздела.СтрокаОтчета КАК Объект,
	|	ТабСтрокиРаздела.Заголовок,
	|	ТабСтрокиРаздела.НомерСтроки КАК НомерОбъекта,
	|	РазделыМакета.Раздел КАК Раздел,
	|	РазделыМакета.Наименование,
	|	РазделыМакета.НомерРаздела КАК НомерРаздела
	|ИЗ
	|	Справочник.РазделыМакетовОтображения.СтрокиРаздела КАК ТабСтрокиРаздела
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РазделыМакета КАК РазделыМакета
	|		ПО ТабСтрокиРаздела.Ссылка = РазделыМакета.Раздел
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерРаздела,
	|	Раздел,
	|	НомерОбъекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабКолонкиРаздела.КолонкаОтчета КАК Объект,
	|	ТабКолонкиРаздела.Заголовок,
	|	ТабКолонкиРаздела.НомерСтроки КАК НомерОбъекта,
	|	РазделыМакета.Раздел КАК Раздел,
	|	РазделыМакета.Наименование,
	|	РазделыМакета.НомерРаздела КАК НомерРаздела
	|ИЗ
	|	РазделыМакета КАК РазделыМакета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РазделыМакетовОтображения.КолонкиРаздела КАК ТабКолонкиРаздела
	|		ПО РазделыМакета.Раздел = ТабКолонкиРаздела.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерРаздела,
	|	Раздел,
	|	НомерОбъекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекШапкаРаздела.ИмяГруппы,
	|	ТекШапкаРаздела.НомерСтроки КАК НомерСтроки,
	|	РазделыМакета.Раздел КАК Раздел,
	|	РазделыМакета.Наименование,
	|	РазделыМакета.НомерРаздела КАК НомерРаздела,
	|	ТекШапкаРаздела.ПолноеИмяГруппы,
	|	ТекШапкаРаздела.Зафиксирована,
	|	ТекШапкаРаздела.ВидГруппировки КАК ВидГруппировки,
	|	ТекШапкаРаздела.ЭлементОтчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТекШапкаРаздела.ЭлементОтчета) = ТИП(СТРОКА)
	|			ТОГДА ТекШапкаРаздела.ЭлементОтчета
	|		ИНАЧЕ ТекШапкаРаздела.ЭлементОтчета.Код
	|	КОНЕЦ КАК КодЭлемента,
	|	ТекШапкаРаздела.РеквизитЭлемента,
	|	ТекШапкаРаздела.ЗаголовокЭлемента,
	|	ТекШапкаРаздела.ШиринаЭлемента,
	|	ТекШапкаРаздела.БезЗаголовка,
	|	ТекШапкаРаздела.ПредставлениеПустого,
	|	ТекШапкаРаздела.ФорматКолонки,
	|	ТекШапкаРаздела.НуженОтбор
	|ИЗ
	|	Справочник.РазделыМакетовОтображения.ШапкаРаздела КАК ТекШапкаРаздела
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РазделыМакета КАК РазделыМакета
	|		ПО ТекШапкаРаздела.Ссылка = РазделыМакета.Раздел
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерРаздела,
	|	Раздел,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Владелец", МакетСсылка);
	Результаты = Запрос.ВыполнитьПакет();
	Выборка = Результаты[1].Выбрать();
	ВыборкаСтрок = Результаты[2].Выбрать();
	ВыборкаКолонок = Результаты[3].Выбрать();
	ВыборкаШапкаРаздела = Результаты[4].Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		СоответствиеЭлементовИКодов = Новый Соответствие;
		
		РазделСсылка = Выборка.Раздел;
		СтруктураПоиска = Новый Структура("Раздел",РазделСсылка);
		
		Раздел = СоздатьРазделМакетаОтображения(МакетОтображения);
		Раздел.Заголовок = Выборка.Наименование;
		
		ВыборкаСтрок.Сбросить();
			
		Пока ВыборкаСтрок.НайтиСледующий(СтруктураПоиска) Цикл
			
			СтрокаМакетаСтруктуры = МакетПоСтруктуре.Разделы[0].СтрокиРаздела.Найти(ВыборкаСтрок.Объект, "Объект");
			
			Если СтрокаМакетаСтруктуры <> Неопределено Тогда
				СтрокаСоздаваемогоМакета = Раздел.СтрокиРаздела.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСоздаваемогоМакета, СтрокаМакетаСтруктуры);
				Если Не ПустаяСтрока(ВыборкаСтрок.Заголовок) Тогда
					СтрокаСоздаваемогоМакета.Заголовок = ВыборкаСтрок.Заголовок;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ВыборкаКолонок.Сбросить();
		Пока ВыборкаКолонок.НайтиСледующий(СтруктураПоиска) Цикл
			ГрафаМакетаСтруктуры = МакетПоСтруктуре.Разделы[0].ГрафыРаздела.Найти(ВыборкаКолонок.Объект, "Объект");
			Если ГрафаМакетаСтруктуры <> Неопределено Тогда
				ГрафаСоздаваемогоМакета = Раздел.ГрафыРаздела.Добавить();
				ЗаполнитьЗначенияСвойств(ГрафаСоздаваемогоМакета, ГрафаМакетаСтруктуры);
				Если Не ПустаяСтрока(ВыборкаКолонок.Заголовок) Тогда
					ГрафаСоздаваемогоМакета.Заголовок = ВыборкаКолонок.Заголовок;
				КонецЕсли;
			КонецЕсли;						
		КонецЦикла;
				
		ВыборкаШапкаРаздела.Сбросить();
		
		Пока ВыборкаШапкаРаздела.НайтиСледующий(СтруктураПоиска) Цикл
			
			ТекШапка = Раздел.ШапкаРаздела.Добавить();
			ЗаполнитьЗначенияСвойств(ТекШапка,ВыборкаШапкаРаздела);
			
			Если ТипЗнч(ВыборкаШапкаРаздела.ЭлементОтчета) = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") Тогда
				ТекШапка.КодЭлемента = "Аналитика" + СокрЛП(ВыборкаШапкаРаздела.КодЭлемента);
			ИначеЕсли ТипЗнч(ВыборкаШапкаРаздела.ЭлементОтчета) = Тип("ПланВидовХарактеристикСсылка.СвойстваОбъектов") Тогда
				ТекШапка.КодЭлемента = "Свойство" + СокрЛП(ВыборкаШапкаРаздела.КодЭлемента);
			Иначе
				ТекШапка.КодЭлемента = СокрЛП(ВыборкаШапкаРаздела.КодЭлемента);
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	
	Возврат МакетОтображения;

КонецФункции // СоздатьМакетПоОписанию()

Функция СоздатьМакетОтображенияПоСтруктуреОтчета(Знач ВидОтчета)

	МакетОтображения = СоздатьПустойМакетОтображения();
	
	ОсновнойРаздел = СоздатьРазделМакетаОтображения(МакетОтображения);
	ОсновнойРаздел.Заголовок = НСтр("ru='Основной раздел'");
	
	ЗаполнитьОписанияСтрокОтчета(ВидОтчета, ОсновнойРаздел.СтрокиРаздела);
	ЗаполнитьОписанияГрафОтчета(ВидОтчета , ОсновнойРаздел.ГрафыРаздела);
	
	Возврат МакетОтображения;
	
КонецФункции // СоздатьМакетОтображенияПоСтруктуреОтчета()

Функция СоздатьПустойМакетОтображения()

	МакетОтображения = Новый Структура;
	МакетОтображения.Вставить("Разделы", Новый Массив);
	
	Возврат МакетОтображения;

КонецФункции // СоздатьПустойМакетОтображения()

Функция СоздатьРазделМакетаОтображения(МакетОтображения)

	Раздел = Новый Структура;
	Раздел.Вставить("Заголовок", "");
	Раздел.Вставить("Индекс"   , МакетОтображения.Разделы.Количество());
	Раздел.Вставить("СтрокиРаздела", СоздатьОписаниеСтрокРаздела());
	Раздел.Вставить("ГрафыРаздела" , СоздатьОписаниеГрафРаздела());
	Раздел.Вставить("ШапкаРаздела" , СоздатьОписаниеШапкиРаздела());
	
	МакетОтображения.Разделы.Добавить(Раздел);
	
	Возврат Раздел;

КонецФункции // СоздатьРазделМакетаОтображения()

Функция СоздатьОписаниеШапкиРаздела()

	ШапкаРаздела = Новый ТаблицаЗначений;
	ШапкаРаздела.Колонки.Добавить("ИмяГруппы"  , Новый ОписаниеТипов("Строка"));
	ШапкаРаздела.Колонки.Добавить("ПолноеИмяГруппы", Новый ОписаниеТипов("Строка"));
	ШапкаРаздела.Колонки.Добавить("ВидГруппировки", Новый ОписаниеТипов("Строка"));
	ШапкаРаздела.Колонки.Добавить("Зафиксирована", Новый ОписаниеТипов("Булево"));
	ШапкаРаздела.Колонки.Добавить("ЭлементОтчета");
	ШапкаРаздела.Колонки.Добавить("КодЭлемента",Новый ОписаниеТипов("Строка"));
	ШапкаРаздела.Колонки.Добавить("РеквизитЭлемента",Новый ОписаниеТипов("Строка"));
	ШапкаРаздела.Колонки.Добавить("ЗаголовокЭлемента",Новый ОписаниеТипов("Строка"));
	ШапкаРаздела.Колонки.Добавить("ШиринаЭлемента",Новый ОписаниеТипов("Число"));
	ШапкаРаздела.Колонки.Добавить("БезЗаголовка",Новый ОписаниеТипов("Булево"));
	ШапкаРаздела.Колонки.Добавить("НуженОтбор",Новый ОписаниеТипов("Булево"));
	ШапкаРаздела.Колонки.Добавить("ПредставлениеПустого",Новый ОписаниеТипов("Строка"));
	ШапкаРаздела.Колонки.Добавить("ФорматКолонки",Новый ОписаниеТипов("Строка"));
	
	Возврат ШапкаРаздела;

КонецФункции // СоздатьОписаниеШапкиРаздела()

Функция СоздатьОписаниеКомпонентовРаздела(Знач ИмяТипаОбъекта)

	КомпонентыРаздела = Новый ТаблицаЗначений;
	КомпонентыРаздела.Колонки.Добавить("Объект"         , Новый ОписаниеТипов(ИмяТипаОбъекта));
	КомпонентыРаздела.Колонки.Добавить("Код"            , Новый ОписаниеТипов("Строка"));
	КомпонентыРаздела.Колонки.Добавить("Заголовок"      , Новый ОписаниеТипов("Строка"));
	КомпонентыРаздела.Колонки.Добавить("СпособОбработки", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыОбработкиПоказателейОтчетов"));
	
	Возврат КомпонентыРаздела;

КонецФункции // СоздатьОписаниеКомпонентаРаздела()

Функция СоздатьОписаниеСтрокРаздела()

	СтрокиРаздела = СоздатьОписаниеКомпонентовРаздела("СправочникСсылка.СтрокиОтчетов");
	СтрокиРаздела.Колонки.Добавить("ЕстьАналитика"        , Новый ОписаниеТипов("Булево"));
	СтрокиРаздела.Колонки.Добавить("РегламентированныйКод", Новый ОписаниеТипов("Строка"));
	СтрокиРаздела.Колонки.Добавить("ГруппаРаскрытия"     , Новый ОписаниеТипов("СправочникСсылка.ГруппыРаскрытия"));
	СтрокиРаздела.Колонки.Добавить("СпособРедактирования" , Новый ОписаниеТипов("Строка"));
	СтрокиРаздела.Колонки.Добавить("ОписаниеАналитики");
	
	Возврат СтрокиРаздела;

КонецФункции // СоздатьОписаниеСтрокРаздела()

Функция СоздатьОписаниеГрафРаздела()

	ГрафыРаздела = СоздатьОписаниеКомпонентовРаздела("СправочникСсылка.КолонкиОтчетов");
	ГрафыРаздела.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"));
	
	Возврат ГрафыРаздела;

КонецФункции // СоздатьОписаниеГрафРаздела()

Функция СоздатьОписаниеАналитикиСтрок()

	ОписаниеАналитик = Новый ТаблицаЗначений;
	ОписаниеАналитик.Колонки.Добавить("ВидАналитики", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АналитикаОтчетов"));
	ОписаниеАналитик.Колонки.Добавить("Код"         , Новый ОписаниеТипов("Строка"));
	ОписаниеАналитик.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ОписаниеАналитик.Колонки.Добавить("ТипЗначения",  Новый ОписаниеТипов("ОписаниеТипов"));
	ОписаниеАналитик.Колонки.Добавить("Обязательный", Новый ОписаниеТипов("Булево"));
	ОписаниеАналитик.Колонки.Добавить("ВидКлассификатораБК",  Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКлассификаторовОтчетов"));
	
	Возврат ОписаниеАналитик;
	
КонецФункции // СоздатьОписаниеАналитикиСтрок()

Процедура ЗаполнитьОписанияСтрокОтчета(Знач ВидОтчета, Знач ОписанияСтрок)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыРаскрытияАналитика.Ссылка КАК Ссылка,
	|	ГруппыРаскрытияАналитика.НомерСтроки,
	|	ГруппыРаскрытияАналитика.ВидАналитики,
	|	ГруппыРаскрытияАналитика.Обязательный,
	|	ГруппыРаскрытияАналитика.ВидАналитики.Код,
	|	ГруппыРаскрытияАналитика.ВидАналитики.Наименование,
	|	ГруппыРаскрытияАналитика.ВидАналитики.ТипЗначения,
	|	ГруппыРаскрытияАналитика.ВидАналитики.ВидКлассификатораБК КАК ВидКлассификатораБК
	|ПОМЕСТИТЬ АналитикаСтрок
	|ИЗ
	|	Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	|ГДЕ
	|	ГруппыРаскрытияАналитика.Ссылка.Владелец = &Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиОтчетов.Ссылка КАК Объект,
	|	СтрокиОтчетов.Код КАК Код,
	|	СтрокиОтчетов.Наименование,
	|	СтрокиОтчетов.СпособОбработки КАК СпособОбработки,
	|	ВЫБОР
	|		КОГДА СтрокиОтчетов.ГруппаРаскрытия = ЗНАЧЕНИЕ(Справочник.ГруппыРаскрытия.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьАналитика,
	|	СтрокиОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
	|	СтрокиОтчетов.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(5)) КАК РегламентированныйКод
	|ПОМЕСТИТЬ СтрокиОтчетов
	|ИЗ
	|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО СтрокиОтчетов.Ссылка = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоРегламентированныйКод)
	|ГДЕ
	|	СтрокиОтчетов.Владелец = &Владелец
	|	И СтрокиОтчетов.ПометкаУдаления = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГруппаРаскрытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиОтчетов.Объект КАК Объект,
	|	СтрокиОтчетов.Код КАК Код,
	|	СтрокиОтчетов.Наименование КАК Заголовок,
	|	СтрокиОтчетов.СпособОбработки КАК СпособОбработки,
	|	ВЫБОР
	|		КОГДА СтрокиОтчетов.ГруппаРаскрытия = ЗНАЧЕНИЕ(Справочник.ГруппыРаскрытия.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьАналитика,
	|	СтрокиОтчетов.РегламентированныйКод,
	|	АналитикаСтрок.ВидАналитики,
	|	АналитикаСтрок.НомерСтроки КАК НомерСтроки,
	|	АналитикаСтрок.Обязательный,
	|	АналитикаСтрок.ВидАналитикиКод,
	|	АналитикаСтрок.ВидАналитикиНаименование,
	|	АналитикаСтрок.ВидАналитикиТипЗначения,
	|	АналитикаСтрок.ВидКлассификатораБК КАК ВидКлассификатораБК,
	|	СтрокиОтчетов.ГруппаРаскрытия
	|ИЗ
	|	СтрокиОтчетов КАК СтрокиОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикаСтрок КАК АналитикаСтрок
	|		ПО СтрокиОтчетов.ГруппаРаскрытия = АналитикаСтрок.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтрокиОтчетов.ПорядковыйНомер,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Запрос.УстановитьПараметр("СвойствоРегламентированныйКод", ПланыВидовХарактеристик.СвойстваОбъектов.КодСтроки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Объект") Цикл
		
		СтрокаРаздела = ОписанияСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРаздела, Выборка);
		СтрокаРаздела.РегламентированныйКод = СокрП(Выборка.РегламентированныйКод);
		СтрокаРаздела.СпособРедактирования = "ВЭтомОкне";
		
		Если Выборка.ЕстьАналитика Тогда
			
			ОписаниеАналитики = СоздатьОписаниеАналитикиСтрок();
			Пока Выборка.СледующийПоЗначениюПоля("ВидАналитики") Цикл
				
				Если ЗначениеЗаполнено(Выборка.ВидАналитики) Тогда
					СтрАналитики = ОписаниеАналитики.Добавить();
					СтрАналитики.ВидАналитики = Выборка.ВидАналитики;
					СтрАналитики.Код          = Выборка.ВидАналитикиКод;
					СтрАналитики.Наименование = Выборка.ВидАналитикиНаименование;
					СтрАналитики.ТипЗначения  = Выборка.ВидАналитикиТипЗначения;
					СтрАналитики.Обязательный = Выборка.Обязательный;
					СтрАналитики.ВидКлассификатораБК  = Выборка.ВидКлассификатораБК;
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокаРаздела.ОписаниеАналитики = ОписаниеАналитики;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьОписанияГрафОтчета(Знач ВидОтчета, Знач ОписанияГраф)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КолонкиОтчетов.Ссылка КАК Объект,
	|	КолонкиОтчетов.Код КАК Код,
	|	КолонкиОтчетов.Наименование КАК Заголовок,
	|	КолонкиОтчетов.ТипЗначения КАК ТипЗначенияПеречисление,
	|	КолонкиОтчетов.СпособОбработки КАК СпособОбработки
	|ИЗ
	|	Справочник.КолонкиОтчетов КАК КолонкиОтчетов
	|ГДЕ
	|	КолонкиОтчетов.Владелец = &Владелец
	|	И КолонкиОтчетов.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолонкиОтчетов.ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ГрафаРаздела = ОписанияГраф.Добавить();
		ЗаполнитьЗначенияСвойств(ГрафаРаздела, Выборка);
		
		Если ЗначениеЗаполнено(Выборка.ТипЗначенияПеречисление) Тогда
			ГрафаРаздела.ТипЗначения = БюджетнаяОтчетность.ПолучитьОписаниеТиповДляЗначенияПоказателя(Выборка.ТипЗначенияПеречисление);
		Иначе
			ГрафаРаздела.ТипЗначения = БюджетнаяОтчетность.ОписаниеТиповЧисловогоЗначенияПоказателя();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
